<template>
    <SliderComponent  :slide="slide"/>
    <v-container class="accordions-container">
        <AccordionComponent :accordion="accordion"/>
        <div>
            <!-- <CardFeedbackComponent class="mb-5"/> -->
            <FeedbackCardComponent/>
        </div>
    </v-container>
    <HistoryCompanyComponent/>
</template>

<script setup>
import SliderComponent from "@/components/SliderComponent.vue"
import AccordionComponent from "@/components/AccordionComponent.vue"
import CardFeedbackComponent from '@/components/CardFeedbackComponent.vue'
import FeedbackCardComponent from '@/components/FeedbackCardComponent.vue'
import HistoryCompanyComponent from '@/components/HistoryCompanyComponent.vue'
</script>
<script>
    export default {
        data(){
            return {
                slide: [
                {
                    img: 'first-slide-company',
                    title: '«ЗАПОЛЬСКИЙ И ПАРТНЕРЫ»',
                    subtitle: 'адвокатское бюро',
                    text: 'Каждая правовая ситуация является уникальной и требует индивидуального подхода. Мы вкладываем все свои знания и опыт, чтобы найти наилучшее решение для каждого клиента.'
                },
                {
                    img: 'second-slide-company',
                    title: '«ЗАПОЛЬСКИЙ И ПАРТНЕРЫ»',
                    subtitle: 'адвокатское бюро',
                    text: 'Каждая правовая ситуация является уникальной и требует индивидуального подхода. Мы вкладываем все свои знания и опыт, чтобы найти наилучшее решение для каждого клиента.'
                },
                {
                    img: 'third-slide-company',
                    title: '«ЗАПОЛЬСКИЙ И ПАРТНЕРЫ»',
                    subtitle: 'адвокатское бюро',
                    text: 'Каждая правовая ситуация является уникальной и требует индивидуального подхода. Мы вкладываем все свои знания и опыт, чтобы найти наилучшее решение для каждого клиента.'
                },
            ],
            accordion: [
                {
                    title: 'О нас',
                    text: 'Сильной стороной нашего адвокатского бюро всегда было тесное деловое сотрудничество с адвокатскими коллегиями, юридическими фирмами, расположенными в разных регионах Российской Федерации, стран содружества независимых государств и дальнего зарубежья. Это сотрудничество носит двусторонний характер – зачастую адвокаты из регионов поручают нам сопровождать то или иное дело в высших судебных или административных инстанциях страныС самого начала деятельности бюро и настоящего времени клиентами бюро становились федеральные и региональные органы власти и управления, включая администрацию Президента РФ, ряд федеральных министерств и ведомств, такие как Минатом РФ, Минтруд РФ, Минобороны РФ и их подразделения, ряд региональных правительств, крупные хозяйствующие субъекты, такие как Уралвагонзавод, Волжский трубный завод, Внешэкономбанк, Салаватнефтеоргсинтез, Управляющая компания «Интерстрой». Многократно Бюро оказывало юридическую помощь малым и средним предприятиям, индивидуальным предпринимателям, сельскохозяйственным и другим кооперативам и, конечно же, гражданам по наследственным, налоговым, трудовым, гражданским, уголовным делам.'
                },
                {
                    title: 'Прочная опора на науку',
                    text: 'Немаловажная особенность работы нашего бюро – прочная опора на науку. В составе адвокатов бюро были всегда доктора и кандидаты юридических наук, способные воплотить научные ценности в реальную практическую, юридическую помощь. В их числе Заслуженные юристы Российской Федерации Запольский С.В. и Исаков В.Б., кандидаты юридических наук О.И. Киселева, И.С. Краскова, В.Н. Назаров. Мы также опираемся на наших экспертов, работающих в научно-исследовательских учреждениях, профильных кафедрах ведущих высших учебных заведений, ветеранов дипломатической, юридической службы и судебно-прокурорских органов. В частности, в составе нашего бюро работает В.Ф. Фомичев – в прошлом являвшийся чрезвычайным и полномочным посланникомм РФ, специализирующийся в международном космическом праве. Все адвокаты бюро в настоящее время преподают различные правовые дисциплины в ВУЗах г. Москвы. Важнейшая заповедь адвокатов бюро – соответствовать современным требованиям, которые выдвигает экономическая жизнь страны, изменяющаяся и осложняющаяся социально-экономическими процессами. На протяжении более чем 30-летнего периода работы адвокатского бюро постоянно менялись приоритеты и потребности – от организационной работы, связанной с созданием новых экономических структур, таких как совместные предприятия, коммерческие и некоммерческие организации, и многих других. Мы настраивались на юридическую помощь этим новым структурам в развитии их деятельности, в юридической защите предпринимателей как в гражданско-правовой, так и в уголовно-правовой сферах.'
                },
                {
                    title: 'Большой опыт',
                    text: 'Большую часть практики адвокатского бюро составляют административные, уголовные и гражданские дела о защите чести и достоинстве граждан, об исполнении воли наследодателя, о дорожно-транспортных происшествиях, о защите прав ребенка и по другим делам, касающимся непосредственно граждан. Адвокаты бюро также вовлечены в дела о банкротстве как хозяйствующих субъектов юридических лиц, так и банкротстве граждан. Отдельную и также важную сферу деятельности бюро составляют хозяйственные споры организаций и предприятий между собой, рассматриваемые в арбитражных судах страны об оплате произведенной продукции, проектно-изыскательских работ и капитального строительства, различных услуг, по финансированию научно-исследовательских и внедренческих работ, по кредитованию, по государственным заказам. Особая сфера нашей деятельности – разнообразные экспертизы и заключения по отдельным направлениям правоприменения, которые помогают в ходе судебных заседаний найти истину и правильное решение спора. Еще одним ведущим направлением деятельности бюро является защита лиц в уголовном производстве, в том числе по экономическим, коррупционным преступлениям, а также иным делам. Адвокаты нашего бюро исходит из принципа, что любая организация и гражданин имеет право на юридическую защиту и квалифицированную юридическую помощь, даже если ими совершены те или иные серьезные правонарушения. Мы уверены, что справедливость достигается только в результате судебного или административного судопроизводства, в ходе дискуссии сторон, но никоим образом в одностороннем порядке, без проверки имеющихся доказательств, свидетельских показаний и соответствующих документов. Мы убеждены в том, что одна из высших юридических и человеческих ценностей – это презумпция невиновности и в том, что закон и справедливость — есть высшие ценности человеческой цивилизации.'
                },
            ],
            }
        },
        mounted(){
            window.scrollTo(0,0);
        },
    }
</script>

<style>
.carousel .v-btn--active > .v-btn__overlay, .v-btn[aria-haspopup=menu][aria-expanded=true] > .v-btn__overlay {
      opacity: 0 !important;
}
.carousel .v-btn__content{
    color: grey;
}
.carousel .v-btn--active .v-btn__content{
    color: white;
}
.mySwiper{
    height: 100vh;
}

html{
    overflow-y: scroll;
    scrollbar-color: var(--red-legal) #f3f3f3;
    scrollbar-width: thin;
}
body::-webkit-scrollbar {
    width: 5px;
}
body::-webkit-scrollbar-track {
    background: #f3f3f3;
}

body::-webkit-scrollbar-thumb {
    background: var(--red-legal);
}

body::-webkit-scrollbar-thumb:hover {
    background: var(--black-legal);
}
.v-btn--variant-plain{
    transition: 0.4s;
}
.v-card--variant-elevated {
    box-shadow: none;
}
.v-expansion-panel{
    border-radius: 0px;
    border: 1px var(--grey-legal) solid;
}
.v-expansion-panel__shadow{
    box-shadow: none;
    border: 1px var(--grey-legal) solid;
}
.v-card{
    border-radius: 0;
}
.v-ripple__container {
    display:none !important;
}
.v-btn--variant-elevated{
    box-shadow: none;
}
.t-red{
    color: var(--red-legal);
}
.bg-gray{
    background-color: var(--grey-light-legal);
}
@media (min-width: 1480px){
    .v-container {
        max-width: 90%;
    }
}
@media (min-width: 1280px){
    .v-container {
        max-width: 97%;
    }
}
@media (min-width: 960px){
    .v-container {
        max-width: 90%;
    }
}
</style>
