<template>
    <SliderComponent  :slide="slider"/>
    <v-container>
        <div class="accordions-container">
            <AccordionComponent :accordion="accordion"/>
            <div class="d-flex flex-column align-end">
                <div>
                    <!-- <CardFeedbackComponent class="mb-5"/> -->
                    <FeedbackCardComponent/>
                </div>
            </div>
        </div>
    </v-container>
</template>

<script>
import SliderComponent from '@/components/SliderComponent.vue'
import AccordionComponent from '@/components/AccordionComponent.vue'
import CardFeedbackComponent from '@/components/CardFeedbackComponent.vue'
import FeedbackCardComponent from '@/components/FeedbackCardComponent.vue'
export default {
    components: { SliderComponent, AccordionComponent, CardFeedbackComponent, FeedbackCardComponent },
    data(){
        return {
            slider: [
                {
                    text: 'На нашем счету множество побед, интересных правовых прецедентов, оправдательных приговоров и благодарностей. Мы сможем ответить на любой ваш вопрос, касающийся права.',
                    img: 'four-slide-company',
                    title: '«ЗАПОЛЬСКИЙ И ПАРТНЕРЫ»',
                    subtitle: 'адвокатское бюро',
                },
                {
                    text: 'Мы — команда высококлассных специалистов и правопреемник первого в России частного адвокатского объединения, защищаем права и интересы бизнеса и граждан  с 1990 года.',
                    img: 'second-slide-company',
                    title: '«ЗАПОЛЬСКИЙ И ПАРТНЕРЫ»',
                    subtitle: 'адвокатское бюро',
                },
                {
                    img: 'first-slide-company',
                    title: '«ЗАПОЛЬСКИЙ И ПАРТНЕРЫ»',
                    subtitle: 'адвокатское бюро',
                    text: 'Каждая правовая ситуация является уникальной и требует индивидуального подхода. Мы вкладываем все свои знания и опыт, чтобы найти наилучшее решение для каждого клиента.'
                },
                {
                    img: 'third-slide-company',
                    title: '«ЗАПОЛЬСКИЙ И ПАРТНЕРЫ»',
                    subtitle: 'адвокатское бюро',
                    text: 'Каждая правовая ситуация является уникальной и требует индивидуального подхода. Мы вкладываем все свои знания и опыт, чтобы найти наилучшее решение для каждого клиента.'
                },
            ],
            accordion: [
                {
                    title: 'Что можно спрашивать в адвокатском запросе?',
                    text: 'Адвокат может запрашивать все необходимые документы, имеющие значение для дела. Такие как: справки, характеристики, предметы, фото – аудио – видеоматериалы, а также другие носители информации. Срок ответа на адвокатский запрос. Организации, которым направлен адвокатский запрос, должны в тридцатидневный срок со дня получения в письменной форме дать на него ответ.'
                },
                {
                    title: 'Кто может защищать интересы в суде кроме адвоката?',
                    text: 'Адвокат может запрашивать все необходимые документы, имеющие значение для дела. Такие как: справки, характеристики, предметы, фото – аудио – видеоматериалы, а также другие носители информации. Срок ответа на адвокатский запрос. Организации, которым направлен адвокатский запрос, должны в тридцатидневный срок со дня получения в письменной форме дать на него ответ.'
                },
                {
                    title: 'Когда адвокат может разглашать адвокатскую тайну?',
                    text: 'Адвокат может запрашивать все необходимые документы, имеющие значение для дела. Такие как: справки, характеристики, предметы, фото – аудио – видеоматериалы, а также другие носители информации. Срок ответа на адвокатский запрос. Организации, которым направлен адвокатский запрос, должны в тридцатидневный срок со дня получения в письменной форме дать на него ответ.'
                },
                {
                    title: 'Защита на предварительном следствии',
                    text: 'Адвокат может запрашивать все необходимые документы, имеющие значение для дела. Такие как: справки, характеристики, предметы, фото – аудио – видеоматериалы, а также другие носители информации. Срок ответа на адвокатский запрос. Организации, которым направлен адвокатский запрос, должны в тридцатидневный срок со дня получения в письменной форме дать на него ответ.'
                },
                {
                    title: 'Какую информацию можно предоставлять адвокату?',
                    text: 'Адвокат может запрашивать все необходимые документы, имеющие значение для дела. Такие как: справки, характеристики, предметы, фото – аудио – видеоматериалы, а также другие носители информации. Срок ответа на адвокатский запрос. Организации, которым направлен адвокатский запрос, должны в тридцатидневный срок со дня получения в письменной форме дать на него ответ.'
                },
            ]
        }
    },
    mounted(){
        window.scrollTo(0,0);
    },
}
</script>

<style>

</style>