<template>
    <SliderComponent  :slide="slider"/>
    <v-container>
        <div class="accordions-container">
            <ProcessesAccordionComponent :accordion="accordion"/>
            <ProcessesBannerComponent class="d-flex justify-end"/>
        </div>
    </v-container>
</template>

<script>
import SliderComponent from '@/components/SliderComponent.vue'
import ProcessesAccordionComponent from '@/components/ProcessesAccordionComponent.vue'
import ProcessesBannerComponent from '@/components/ProcessesBannerComponent.vue'
export default {
    components: { SliderComponent, ProcessesAccordionComponent, ProcessesBannerComponent },
    data(){
        return {
            slider: [
                {
                    img: 'third-slide-company',
                    title: '«ЗАПОЛЬСКИЙ И ПАРТНЕРЫ»',
                    subtitle: 'адвокатское бюро',
                    text: 'Каждая правовая ситуация является уникальной и требует индивидуального подхода. Мы вкладываем все свои знания и опыт, чтобы найти наилучшее решение для каждого клиента.'
                },
                {
                    text: 'Мы — команда высококлассных специалистов и правопреемник первого в России частного адвокатского объединения, защищаем права и интересы бизнеса и граждан  с 1990 года.',
                    img: 'second-slide-company',
                    title: '«ЗАПОЛЬСКИЙ И ПАРТНЕРЫ»',
                    subtitle: 'адвокатское бюро',
                },
                {
                    img: 'first-slide-company',
                    title: '«ЗАПОЛЬСКИЙ И ПАРТНЕРЫ»',
                    subtitle: 'адвокатское бюро',
                    text: 'Наша практика составляет более тридцати лет работы во всех отраслях права. Мы участвовали в самых разных делах и процессах как с юридическими, так и с физическими лицами. '
                },
            ],
            accordion: [
                {
                    title: 'Взыскали с заказчика оплату за выполнение работ по проектной документации, хотя исполнитель (наш клиент) формально просрочил работы на 11 месяцев, а документация не прошла государственную экспертизу.',
                    client: 'компания, разрабатывающая проектную документацию для строительства зданий.',
                    problem: ' клиент выполнил работы по проектированию реконструкции жилого здания в Москве в соответствии с техническим заданием заказчика, но заказчик не принял и не оплатил работы.',
                    task: 'доказать, что работы была выполнены качественно и в срок, должны были быть приняты и оплачены. Взыскать оплаты по договору и неустойку за просрочку оплаты.',
                    bad_result: 'клиент не получает ни оплату, ни неустойку, а у заказчика появляются основания для взыскания с нашего клиента уплаченного аванса и неустойки за просрочку выполнения работы, которая формально была очень существенной.',
                    result: 'мы убедили суд в своей правоте, взыскали долг по договору и неустойку.',
                },
                {
                    title: 'Взыскали с завода неосновательное обогащение и не позволили ответчику схитрить, чтобы не платить неустойку.',
                    client: 'компания, занимающаяся оптовой торговлей строительными материалами, в том числе трубами, для нужд строительных компаний.',
                    problem: 'компания заключила договор с заводом на поставку партии труб и внесла предоплату — 1 764 000 рублей. Завод обязательства не исполнил и вернул всего 364 000 рублей. Остальные 1 400 000 не возвращал, на письменные претензии и письма по электронной почте не отвечал.',
                    task: 'вернуть сумму основного долга — 1 400 000 рублей + проценты по ст.395 ГК РФ + расходы на юридическую помощь и услуги представителя + госпошлину.',
                    bad_result: 'клиент ничего не получает.',
                    result: 'заявленные требования удовлетворены, клиент получил все причитающиеся ему средства.',
                },
                {
                    title: 'Заключили мировое соглашение с медицинской клиникой',
                    client: 'женщина, которой был неправильно установлен коленный протез.',
                    problem: 'из-за неправильной установки протеза у пациентки возникают боль, трудности с передвижением.',
                    task: 'взыскать с клиники расходы на лечение, компенсацию морального вреда, неустойку, штраф.',
                    bad_result: 'если бы суд отказал, наша клиентка не получила бы никаких выплат от клиники.',
                    result: 'с клиникой достигнуто мировое соглашение.',
                },
                {
                    title: 'Взыскали со страховой компании страховое возмещение в пользу банка, сохранив тем самым для клиента ипотечную квартиру.',
                    client: 'наследник умершей женщины.',
                    problem: 'жизнь умершей была застрахована в Спасских воротах, но страховщик не признал смерть страховым случаем и, как следствие, отказал в страховой выплате. Страховая выплата должна была уйти Сбербанку, где у умершей была оформлена в ипотеку квартира в счёт оплаты ипотеки.',
                    task: 'добиться, чтобы Спасские ворота признали случай страховым и выплатили страховку — 1 200 000 рублей.',
                    bad_result: 'если бы мы проиграли суд, то наследникам пришлось бы выплачивать ипотеку самостоятельно или лишаться квартиры.',
                    result: 'с помощью суда мы добились того, что требовалось клиенту.',
                },
                {
                    title: 'Помогли вступить в наследство, при том, что в документах была масса ошибок.',
                    client: 'наследник.',
                    problem: 'невозможность вступить в наследство, поскольку из-за большого количества ошибок в документах наследника и наследодателя родство между ними было под вопросом.',
                    task: 'доказать в суде родство между наследодателем и наследником, чтобы последний мог вступить в наследство.',
                    bad_result: 'если бы суд отказал, то наш клиент-наследник лишился бы возможности вступить в наследство.',
                    result: 'суд встал на нашу сторону, и наследник вступил в свои права.',
                },
                {
                    title: 'Добились возврата средств, уплаченных по договору аренды, при том, что имеется масса отрицательной судебной практики по подобным вопросам.',
                    client: 'субъект хозяйственной деятельности, арендующий помещение по договору субсубаренды.',
                    problem: 'собственник помещений признан банкротом, договор аренды расторгнут. Возникает новый арендатор, который требует с нашего клиента оплату в свою пользу. Но клиент уже успел заключить договор аренды со «старом» субарендатором на 11 месяцев вперёд и оплатить 6 месяцев.',
                    task: 'вернуть деньги, уплаченные «старому» субарендатору.',
                    bad_result: 'если бы суд отказал в удовлетворении требований, клиенту пришлось бы оплачивать аренду второй раз.',
                    result: 'суд встал на нашу сторону и взыскал оплату со «старого» арендатора в пользу нашего клиента-субсубарендатора. Решение устояло в суде апелляционной инстанции.',
                },
            ]    
        }
    },
    mounted(){
        window.scrollTo(0,0);
    },
}
</script>

<style>

</style>