<template>
    <v-container>
        <div  class="accordions-container">
            <AccordionComponent :accordion="accordionIndivid"/>
            <IndividSubtitleComponent/>
        </div>
        <IndividBannerComponent class="my-4"/>
    </v-container>
</template>

<script>
import IndividBannerComponent from './IndividBannerComponent.vue';
import AccordionComponent from './AccordionComponent.vue';
import IndividSubtitleComponent from './IndividSubtitleComponent.vue';

export default {
    components: { AccordionComponent, IndividSubtitleComponent, IndividBannerComponent },
    data(){
        return {
            accordionIndivid: [
                {
                    title: 'Защита прав потребителей',
                    text: 'Потребитель имеет право на приобретение товаров (работ, услуг) надлежащего качества, на их безопасность, на информацию о товарах (работах, услугах) и об их изготовителях (исполнителях, продавцах), а также право на возмещение вреда, причиненного вследствие недостатков товара (работы, услуги).'
                },
                {
                    title: 'Наследство',
                    text: 'Потребитель имеет право на приобретение товаров (работ, услуг) надлежащего качества, на их безопасность, на информацию о товарах (работах, услугах) и об их изготовителях (исполнителях, продавцах), а также право на возмещение вреда, причиненного вследствие недостатков товара (работы, услуги).'
                },
                {
                    title: 'Недвижимость',
                    text: 'Потребитель имеет право на приобретение товаров (работ, услуг) надлежащего качества, на их безопасность, на информацию о товарах (работах, услугах) и об их изготовителях (исполнителях, продавцах), а также право на возмещение вреда, причиненного вследствие недостатков товара (работы, услуги).'
                },
                {
                    title: 'Представительство в суде',
                    text: 'Потребитель имеет право на приобретение товаров (работ, услуг) надлежащего качества, на их безопасность, на информацию о товарах (работах, услугах) и об их изготовителях (исполнителях, продавцах), а также право на возмещение вреда, причиненного вследствие недостатков товара (работы, услуги).'
                },
                {
                    title: 'Судебные споры',
                    text: 'Потребитель имеет право на приобретение товаров (работ, услуг) надлежащего качества, на их безопасность, на информацию о товарах (работах, услугах) и об их изготовителях (исполнителях, продавцах), а также право на возмещение вреда, причиненного вследствие недостатков товара (работы, услуги).'
                },
                {
                    title: 'Трудовые споры',
                    text: 'Потребитель имеет право на приобретение товаров (работ, услуг) надлежащего качества, на их безопасность, на информацию о товарах (работах, услугах) и об их изготовителях (исполнителях, продавцах), а также право на возмещение вреда, причиненного вследствие недостатков товара (работы, услуги).'
                },
                
            ]
        }
    }
}
</script>

<style>

</style>