<template>
    <div class="c">
        <p class="title-text pb-3">В чём заключаются услуги юриста по арбитражным делам</p>
        <p class="sub-text text-roboto pb-3">или что мы сделаем, чтобы вам помочь</p>
        <v-expansion-panels
        v-model="panel">
            <v-expansion-panel
                v-for="item in accordion"
                :key="item.title">
                <v-expansion-panel-title class="text-acc">
                {{item.title}}
                <template v-slot:actions="{ expanded }">
                    <v-img :src="!expanded ? './plus.svg' : './minus.svg'" :width="48" :height="48" class="ml-4"></v-img>
                </template>
                </v-expansion-panel-title>
                <v-expansion-panel-text>
                {{item.text}}
                </v-expansion-panel-text>
            </v-expansion-panel>
        </v-expansion-panels>
    </div>
</template>

<script>
export default {
    data(){
        return{
            accordion: [
                {
                    title: 'Досудебная стадия',
                    text: 'Составим и направим вашему контрагенту претензию. Донесем до оппонента минусы судебной тяжбы и плюсы мирного разрешения ситуации. Организуем переговоры так, чтобы шансы прийти к решению были максимальны. Составим дополнительное соглашение, которое зафиксирует достигнутую договорённость.'
                },
                {
                    title: 'Суд',
                    text: 'Определим, какие документы у вас есть и достаточно ли их. Если недостаточно — соберём недостающие с помощью адвокатских запросов и других мер. Решим, насколько хватает доказательной базы и будет ли она убедительна в суде. Добудем доказательства, подтверждающие вашу правоту.Разработаем правовую позицию, составим исковое заявление и подадим его со всеми документами. Определим, кому предъявлять иск и что требовать. Заявим требования, учитывая, какие доказательства у нас есть и какие мы сможем получить, сделав запрос через суд.Продумаем тактику. Учтем, что предпримет другая сторона и какие доказательства она предоставит. Продумываем разные сценарии процесса и готовимся ко всем. Нас невозможно застать врасплох — мы заранее готовим письменные пояснения на возможные заявления контрагента с документами, которые подтверждают эти позиции.Потребуем назначить экспертизу. Заранее выбираем экспертное учреждение. Получаем в экспертном учреждении информацию, что оно согласно провести экспертизу. Заявляем суду аргументированное ходатайство о назначении экспертизы. Формулируем вопросы эксперту. Если экспертиза была проведена по ходатайству другой стороны, допрашиваем эксперта в судебном заседании.Совершим все необходимые процессуальные действия. При необходимости направим встречный иск, заявим аргументированные жалобы, ходатайства, добьемся наложения обеспечительных мер.'
                },
                {
                    title: 'Исполнение решения суда',
                    text: 'Добиваемся фактического получения вами денег. Участвуем в исполнительном производстве,ищем имущество должника, совместно с судебным приставом выезжаем по месту нахождения этого имущества, добиваемся его ареста и изъятия.Начинаем процедуру банкротства, если исполнительное производство не приносит результатов. Оспариваем сделки должника по выводу имущества, привлекаем контролирующих должника лиц к субсидиарной ответственности.'
                }
            ],
            panel: [0]
        }
    }
}
</script>

<style scoped>
    .title-text{
        font-size: 40px;
        white-space: normal;
    }
    .sub-text{
        color: var(--red-legal);
    }
    .c{
        padding: 40px 0px;
        max-width: 800px;
    }
    @media (max-width: 1100px) {
        .c{
            padding: 40px;
        }
    }
    @media (max-width: 650px) {
        .title-text{
            font-size: 28px;
        }
        .c{
            padding: 40px 10px;
        }
    }
</style>