<template>
    <div>
        <p class="text-title pb-3">Услуги юристов и адвокатов по арбитражным делам</p>
        <div class="pb-3">
            <p class="py-2 text-roboto">Адвокатское Бюро «Запольский и партнёры» — правопреемник первого в России адвокатского образования, созданного в 1990 году.</p>
            <p class="py-2 text-roboto">За более чем тридцать лет работы мы наработали практику во всех отраслях права и участвовали в самых разных делах и процессах. Но мы особенно сильны в двух направлениях: это представление интересов бизнеса в арбитражных делах и защита при уголовном преследовании.</p>
            <p class="py-2 text-roboto">Мы защищали интересы многих российских и иностранных компаний, однако мы не вправе разглашать их имена в связи с необходимостью соблюдения требований законодательства об адвокатской тайне, а так же из уважения к пожеланиям наших клиентов о сохранении конфиденциальности в решении их правовых вопросов.</p>
        </div>
    </div>
</template>

<script>
export default {

}
</script>

<style scoped>
    p{
        color: var(--grey-intense-legal);
    }
    .text-title{
        font-size: 32px;
        color: black;
    }
    .bg{
        background-color: var(--red-legal);
        color: white;
    }
    @media (max-width: 1100px) {
        .text-title{
            font-size: 24px;
        }
    } 
    @media (max-width: 650px) {
        .bg{
            width: 100%;
        }
    }
</style>