<template>
    <div class="info-prsn">
        <span class="text-person">
            <v-img
                :src="`./${personImg}`"
                max-height="350px"
                height="100%"
                max-width="500px"
                width="100%"
                class="img-info"
                cover>
            </v-img>
            <div id="sz" v-bind:class="this.personImg.substr(0,2) != 'sz' ? 'd-none' : ''">
                <span class="text-h6 font-weight-bold text-uppercase">
                    Запольский Сергей Васильевич 
                </span> 
                <span class="text-h6">– управляющий партнер, доктор юридических наук, профессор, заслуженный юрист Российской Федерации.</span>
                <p>Адвокатская практика Сергея Васильевича охватывает широкий круг хозяйственных и финансовых споров между крупными экономическими структурами, а также защиту имущественных и иных интересов российского бизнеса в административных и финансовых конфликтах с государственными органами РФ и иностранных государств.</p>
                <p>На протяжении всей жизни профессиональная деятельность С.В. Запольского связана с финансовым правом: более 30 лет преподавательской деятельности в Свердловском юридическом институте, руководство кафедрой финансового права Российской академии правосудия, руководство соответствующим сектором Института государства и права Российской Академии наук.</p>
                <p>Наряду с научной деятельностью Сергей Васильевич был Депутатом Государственной Думы, Судьей Экономического Суда СНГ, трудился в Аппарате Министерства юстиции СССР и Совета Министров СССР.</p>
                <p>На основе личной судебной практики С.В. Запольским изданы научные работы более чем в 300 авторитетных изданиях, включая ряд учебных пособий для юридических и экономических ВУЗов, а также в целом ряде отдельных монографий и научных статей в периодической печати. </p>
                <p>С. В. Запольский принимает активное участие в развитии Российского законодательства и совершенствовании юридической практики, являясь членом ряда экспертных советов Государственной Думы РФ, Российского Союза юристов, ГК Ассоциации страхования вкладов. Входит в состав редакционных коллегий научных юридических журналов.</p>
                <p>« Профессия адвоката меня нашла сама. Вскоре после перехода на работу в Министерство юстиции СССР, мне поручили вести дело по иску родственников боксеров из США, которые погибли в авиационной катастрофе самолета советского производства Ил-62 под Варшавой. Пришлось работать с представителямизаинтересованных министерств и ведомств и с американскими адвокатами, представляющими наши интересы.</p>
                <p>В конце 80-годов прошлого века я стал учредителем и председателем правления юридической фирмы «Контракт», которая имела большое количество филиалов по стране и осуществляла деятельность по представлению интересов клиентов в судах, в том  числе  и иностранных... Я в основном тогда занимался юридическим консалтингом, формировал юридическую конструкцию нарождающихся совместных предприятий, акционерных обществ, коммерческих банков и т.д. </p>
                <p>Многое мне дало знакомство с известнейшим американским адвокатом Джеромом Шестаком, благодаря которому мне удалось поработать с интересными для тех времен клиентами из США . Мне удалось поучаствовать в деле о возврате партии стабильных изотопов из США, украденных с одного из предприятий атомной промышленности. Работали мы тогда в тесной взаимосвязи с Генеральной прокуратурой Российской Федерации. С того времени я бессменно нахожусь в числе адвокатов – сначала Инюрколлегии, затем Межрегиональной коллегии адвокатов и, наконец, с 2003 года в созданном по моей инициативе Адвокатском бюро «Запольский и  партнеры».</p>
                <p>Как ветеран адвокатского движения могу заметить, что юридическая практика и тенденции адвокатской деятельности в экономике с тех лет бесконечно изменялись – от юридического инжиниринга мы перешли к консалтингу и сопровождению хозяйственной деятельности, но основной для адвоката всегда остается деятельность по представлению интересов своих доверителей в суде. Лично с моим участием рассматривались дела преимущественно в интересах крупных хозяйственных структур и государственных корпораций.</p>
                <p>В 2002 году я участвовал в подготовке Федерального закона «Об адвокатской деятельности и адвокатуре в Российской Федерации».</p>
                <p>Поделюсь сокровенным: любой адвокат должен всегда помнить, что не он, а его доверитель, клиент, заказчик является стороной того или иного юридического дела. Именно доверитель должен принимать окончательное решение. Наша функция как адвокатов доходчиво и толково объяснить клиенту юридические последствия принятия тех или иных решений и помочь воплотить их в жизнь».</p>
            </div>
            <div id="ok" v-bind:class="this.personImg.substr(0,2) != 'ok' ? 'd-none' : ''">
                <span class="text-h6 font-weight-bold text-uppercase">
                    Киселёва Ольга Игоревна   
                </span> 
                <span class="text-h6">является  руководителем судебно-арбитражной практики бюро, кандидат юридических наук.</span>
                <p>Осуществляет профессиональную деятельность в области юриспруденции с 2006 г., имеет опыт работы в кредитных организациях в сфере корпоративного права, соблюдения банками и клиентами банков требований Федерального закона от 07.08.2001 № 115-ФЗ «О противодействии легализации (отмыванию) доходов, полученных преступным путем, и финансированию терроризма», правового сопровождения открытия и ведения счетов крупных отечественных и зарубежных компаний, взаимодействия банка с государственными органами по вопросам соблюдения банковской тайны при предоставлении информации по запросам органов государственной власти, следственных органов и судов.</p>
                <p>С 2013 г. является членом Адвокатской палаты г. Москвы. В настоящее время специализируется на ведении судебных дел по экономическим спорам в области договорного права, корпоративного права, в частности успешно представляет интересы клиентов в сложных спорах по Договорам подряда на выполнение проектных и изыскательских работ, спорах по Договорам поставки.</p>
                <p>Так же обладает большим опытом представления интересов частных лиц по наследственным делам, как в досудебном порядке на стадии ведения наследственных дел в нотариальных конторах, так и в судах, по семейным спорам, связанным с расторжением брака, разделом совместно нажитого имущества супругов, в том числе при наличии долговых обязательств супругов,  определения места жительства несовершеннолетних детей, определения порядка общения с детьми, взыскания алиментов. Представляет интересы клиентов банков – физических лиц при взыскании задолженностей по кредитным договорам, реструктуризации задолженности в досудебном порядке.</p>
                <p>Отдельным направлением деятельности в качестве адвоката является сопровождение сделок с недвижимым имуществом, составление гражданско-правовых договоров, согласование условий брачных договоров и соглашений о разделе совместно нажитого имущества супругов, оценка правовых рисков при заключении сделок физическими и юридическими лицами.</p>
            </div>
        </span>
    </div>
</template>

<script>
    export default {
        data(){
            return{
                personImg: ''
            }
        },
        mounted(){
            this.personImg = localStorage.getItem("personImg")
            window.scrollTo(0,0);
            localStorage.removeItem("personImg"); 
        }
    }
</script>

<style scoped>
.info-prsn{
    padding: 20px 30px;
    height: 100%;
}
.img-info{
    float:left;
    padding: 15px;
}
.text-person{
    text-indent: 1.5em;
    margin-top: 0
}
.text-person p{
    padding: 8px 0;
}
    @media (max-width: 650px) {
        .info-prsn{
            padding: 10px;
        } 
    }
</style>